------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/nathannunn/Documents/Dropbox/Potatoes/REPLICATION_FILES/Replication_ci
> ty_level_results.log
  log type:  text
 opened on:  19 Sep 2010, 18:33:38

. 
. * Conley SEs *
. gen cutoff1=10  /* Closer than cutoff = 1, further = 0 */

. gen cutoff2=10

. gen constant=1

. 
. drop if missing(latitude)==1
(0 observations deleted)

. drop if missing(longitude)==1
(0 observations deleted)

. for @ in any ln_city_population ln_wpot_post year isocode continent: drop if missing(@)=
> =1

->  drop if missing(ln_city_population)==1
(0 observations deleted)

->  drop if missing(ln_wpot_post)==1
(0 observations deleted)

->  drop if missing(year)==1
(0 observations deleted)

->  drop if missing(isocode)==1
(0 observations deleted)

->  drop if missing(continent)==1
(0 observations deleted)

. for @ in any ln_rugged ln_elevation ln_tropics ln_oworld: drop if missing(@)==1

->  drop if missing(ln_rugged)==1
(0 observations deleted)

->  drop if missing(ln_elevation)==1
(2 observations deleted)

->  drop if missing(ln_tropics)==1
(0 observations deleted)

->  drop if missing(ln_oworld)==1
(0 observations deleted)

. 
. **************************************
. *** TABLE 8 - City level estimates ***
. **************************************
. 
. /* Column 1 - Baseline controls only */
. * Conley SEs; num parms = 1 const + 694-1 city FE + 11 year FE + 1 wpot_post + 11*44 con
> trols = 750 
. *xi: x_ols latitude longitude cutoff1 cutoff2 ln_city_population constant ln_wpot_post `
> ln_oworld_flexible' `ln_tropical_flexible' `ln_rugged_flexible' `ln_elevation_flexible' 
> i.year i.city, xreg(750) coord(2)
. * Clustered SEs
. xi: areg ln_city_population ln_wpot_post `ln_oworld_flexible' `ln_tropical_flexible' `ln
> _rugged_flexible' `ln_elevation_flexible' i.year, absorb(city) cluster(isocode)
i.year            _Iyear_1000-1900    (naturally coded; _Iyear_1000 omitted)

Linear regression, absorbing indicators                Number of obs =    1607
                                                       F( 51, 77)    =       .
                                                       Prob > F      =
                                                       R-squared     =  0.7712
                                                       Adj R-squared =  0.5712
                                                       Root MSE      =  .49132

                               (Std. Err. adjusted for 78 clusters in isocode)
------------------------------------------------------------------------------
             |               Robust
ln_city_po~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_wpot_post |   .0499106   .0229568     2.17   0.033     .0041978    .0956234
ln_owor~1100 |    .003157   .0317763     0.10   0.921    -.0601178    .0664318
ln_owor~1200 |  -.0085317   .0428887    -0.20   0.843     -.093934    .0768706
ln_owor~1300 |  -.0325701   .0552316    -0.59   0.557    -.1425503    .0774102
ln_owor~1400 |  -.0115526   .0411475    -0.28   0.780    -.0934878    .0703826
ln_owor~1500 |  -.0332664   .0610844    -0.54   0.588     -.154901    .0883683
ln_owor~1600 |   -.022921   .0430956    -0.53   0.596    -.1087354    .0628933
ln_owor~1700 |  -.0196836   .0361305    -0.54   0.587    -.0916287    .0522614
ln_owor~1750 |  -.0241358   .0471854    -0.51   0.610    -.1180939    .0698223
ln_owor~1800 |   -.038847   .0471454    -0.82   0.412    -.1327255    .0550315
ln_owor~1850 |  -.0147406   .0417893    -0.35   0.725    -.0979536    .0684725
ln_owor~1900 |   .0210588   .0444912     0.47   0.637    -.0675346    .1096521
ln_trop~1100 |  -.0315765   .0367485    -0.86   0.393    -.1047522    .0415991
ln_trop~1200 |  -.0185729   .0334758    -0.55   0.581    -.0852317    .0480859
ln_trop~1300 |  -.0549189   .0299203    -1.84   0.070    -.1144977      .00466
ln_trop~1400 |  -.0597463   .0305054    -1.96   0.054    -.1204904    .0009978
ln_trop~1500 |  -.0592763   .0337033    -1.76   0.083     -.126388    .0078355
ln_trop~1600 |  -.0666758   .0256112    -2.60   0.011    -.1176743   -.0156773
ln_trop~1700 |   -.064484   .0305645    -2.11   0.038    -.1253458   -.0036222
ln_trop~1750 |   -.041356   .0284346    -1.45   0.150    -.0979766    .0152645
ln_trop~1800 |  -.0274434   .0257165    -1.07   0.289    -.0786515    .0237648
ln_trop~1850 |  -.0502373   .0317598    -1.58   0.118     -.113479    .0130045
ln_trop~1900 |  -.0951826   .0370459    -2.57   0.012    -.1689505   -.0214148
ln_rugg~1100 |   .1575619   .3118526     0.51   0.615    -.4634159    .7785397
ln_rugg~1200 |   .3844016    .397138     0.97   0.336    -.4064013    1.175204
ln_rugg~1300 |   .2682978   .4205554     0.64   0.525    -.5691349     1.10573
ln_rugg~1400 |    .284458   .4038111     0.70   0.483    -.5196326    1.088549
ln_rugg~1500 |   .3469236   .3861628     0.90   0.372    -.4220248    1.115872
ln_rugg~1600 |   .3228953   .3377539     0.96   0.342    -.3496587    .9954493
ln_rugg~1700 |   .4196951   .3523067     1.19   0.237    -.2818372    1.121227
ln_rugg~1750 |   .2023962   .3411353     0.59   0.555    -.4768909    .8816833
ln_rugg~1800 |   .2893961   .3535786     0.82   0.416    -.4146689    .9934612
ln_rugg~1850 |   .4309813   .3923218     1.10   0.275    -.3502312    1.212194
ln_rugg~1900 |   .4701914   .4282366     1.10   0.276    -.3825367    1.322919
ln_elev~1100 |    .026486   .1393169     0.19   0.850    -.2509294    .3039014
ln_elev~1200 |   .1120141    .280487     0.40   0.691    -.4465069    .6705352
ln_elev~1300 |   .2145492   .3741286     0.57   0.568    -.5304361    .9595345
ln_elev~1400 |   .1654863   .3286783     0.50   0.616    -.4889959    .8199685
ln_elev~1500 |   .1293667   .4073167     0.32   0.752    -.6817046    .9404379
ln_elev~1600 |   .1912505   .4194266     0.46   0.650    -.6439347    1.026436
ln_elev~1700 |   .0919568    .390929     0.24   0.815    -.6864823    .8703959
ln_elev~1750 |   .2486027   .3179388     0.78   0.437    -.3844944    .8816998
ln_elev~1800 |   .0955124   .3432328     0.28   0.782    -.5879514    .7789762
ln_elev~1850 |  -.0512829   .3255095    -0.16   0.875    -.6994552    .5968894
ln_elev~1900 |  -.1047543   .3108213    -0.34   0.737    -.7236785    .5141699
 _Iyear_1100 |  -.4085914   .6440434    -0.63   0.528    -1.691046    .8738627
 _Iyear_1200 |   -1.61365    1.00657    -1.60   0.113    -3.617988    .3906868
 _Iyear_1300 |   -1.44414   1.454189    -0.99   0.324      -4.3398     1.45152
 _Iyear_1400 |  -1.225856   1.371735    -0.89   0.374     -3.95733    1.505618
 _Iyear_1500 |  -.9626929   1.752198    -0.55   0.584    -4.451764    2.526378
 _Iyear_1600 |  -1.180172   1.838929    -0.64   0.523    -4.841947    2.481603
 _Iyear_1700 |  -.8192558   1.887604    -0.43   0.665    -4.577956    2.939445
 _Iyear_1750 |  -1.663855   1.420051    -1.17   0.245    -4.491537    1.163827
 _Iyear_1800 |  -.8136177   1.419384    -0.57   0.568    -3.639973    2.012737
 _Iyear_1850 |   .0869498    1.38964     0.06   0.950    -2.680176    2.854076
 _Iyear_1900 |   .7366825    1.42278     0.52   0.606    -2.096434    3.569799
       _cons |   10.73375    .172416    62.25   0.000     10.39043    11.07707
-------------+----------------------------------------------------------------
        city |   absorbed                                     (694 categories)

. 
. 
. /* Column 2 - Basline controls & continent x year FEs */
. * Conley SEs; num parms = 1 const + 694-1 city FE + 11 year FE + 1 wpot_post + 11*4 cont
> rols + 11*(4-1) continent-year FE = 783 --- Had to do 2-step method
. *preserve
. *xi: reg ln_city_population           `ln_oworld_flexible' `ln_tropical_flexible' `ln_ru
> gged_flexible' `ln_elevation_flexible' i.year*i.continent i.city
. *predict ln_city_population_resid, resid
. *xi: reg cutoff1 cutoff2 ln_wpot_post `ln_oworld_flexible' `ln_tropical_flexible' `ln_ru
> gged_flexible' `ln_elevation_flexible' i.year*i.continent i.city
. *predict ln_wpot_post_resid, resid
. *x_ols latitude longitude cutoff1 cutoff2 ln_city_population_resid ln_wpot_post_resid, x
> reg(2) coord(2)
. *restore 
. * Clustered SEs
. xi: areg ln_city_population ln_wpot_post `ln_oworld_flexible' `ln_tropical_flexible' `ln
> _rugged_flexible' `ln_elevation_flexible' i.year i.year*i.continent, absorb(city) cluste
> r(isocode)
i.year            _Iyear_1000-1900    (naturally coded; _Iyear_1000 omitted)
i.continent       _Icontinent_1-4     (_Icontinent_1 for c~ent==Africa omitted)
i.year*i.cont~t   _IyeaXcon_#_#       (coded as above)

Linear regression, absorbing indicators                Number of obs =    1607
                                                       F( 50, 77)    =       .
                                                       Prob > F      =
                                                       R-squared     =  0.7911
                                                       Adj R-squared =  0.5968
                                                       Root MSE      =   .4692

                               (Std. Err. adjusted for 78 clusters in isocode)
------------------------------------------------------------------------------
             |               Robust
ln_city_po~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_wpot_post |   .0468373   .0209655     2.23   0.028     .0050898    .0885848
ln_owor~1100 |   .0520721   .0475225     1.10   0.277    -.0425574    .1467016
ln_owor~1200 |   .0580701   .0531196     1.09   0.278    -.0477045    .1638448
ln_owor~1300 |   .0297635   .0535888     0.56   0.580    -.0769454    .1364724
ln_owor~1400 |   .0354451   .0478364     0.74   0.461    -.0598093    .1306996
ln_owor~1500 |   .0225053    .063667     0.35   0.725    -.1042719    .1492825
ln_owor~1600 |   .0225433   .0550056     0.41   0.683    -.0869869    .1320735
ln_owor~1700 |   .0240406   .0471891     0.51   0.612    -.0699248    .1180061
ln_owor~1750 |   .0281322   .0555183     0.51   0.614    -.0824188    .1386832
ln_owor~1800 |   .0155243    .054992     0.28   0.778    -.0939787    .1250274
ln_owor~1850 |   .0264298   .0529906     0.50   0.619    -.0790879    .1319476
ln_owor~1900 |   .0411969   .0528664     0.78   0.438    -.0640736    .1464674
ln_trop~1100 |  -.0266037   .0376699    -0.71   0.482     -.101614    .0484066
ln_trop~1200 |  -.0181733     .04103    -0.44   0.659    -.0998744    .0635277
ln_trop~1300 |  -.0532796   .0348323    -1.53   0.130    -.1226396    .0160804
ln_trop~1400 |  -.0513399   .0359942    -1.43   0.158    -.1230135    .0203337
ln_trop~1500 |  -.0549633   .0416122    -1.32   0.190    -.1378238    .0278972
ln_trop~1600 |  -.0560048   .0344477    -1.63   0.108    -.1245989    .0125893
ln_trop~1700 |  -.0517652   .0360865    -1.43   0.155    -.1236225    .0200921
ln_trop~1750 |  -.0320632   .0376803    -0.85   0.397    -.1070943    .0429678
ln_trop~1800 |  -.0167636   .0347466    -0.48   0.631    -.0859528    .0524257
ln_trop~1850 |  -.0356309    .032285    -1.10   0.273    -.0999185    .0286567
ln_trop~1900 |  -.0655427   .0339126    -1.93   0.057    -.1330713    .0019859
ln_rugg~1100 |  -.1192201   .3190892    -0.37   0.710    -.7546078    .5161675
ln_rugg~1200 |   .1938864   .4076217     0.48   0.636    -.6177922    1.005565
ln_rugg~1300 |   .0890656   .5139724     0.17   0.863    -.9343842    1.112515
ln_rugg~1400 |   .1701032   .4572906     0.37   0.711    -.7404788    1.080685
ln_rugg~1500 |   .2356713   .4164349     0.57   0.573    -.5935566    1.064899
ln_rugg~1600 |   .1503135   .3594723     0.42   0.677    -.5654874    .8661143
ln_rugg~1700 |   .2383056   .3945201     0.60   0.548    -.5472843    1.023895
ln_rugg~1750 |   .0775516   .4187732     0.19   0.854    -.7563324    .9114355
ln_rugg~1800 |   .1916212   .4339099     0.44   0.660    -.6724038    1.055646
ln_rugg~1850 |   .2692698   .4831695     0.56   0.579    -.6928436    1.231383
ln_rugg~1900 |   .1844711   .5155284     0.36   0.721    -.8420772    1.211019
ln_elev~1100 |   .3159754   .2144976     1.47   0.145     -.111144    .7430948
ln_elev~1200 |   .3746534   .3292215     1.14   0.259    -.2809105    1.030217
ln_elev~1300 |   .4785349   .3405896     1.41   0.164    -.1996656    1.156735
ln_elev~1400 |   .3516617   .3318405     1.06   0.293    -.3091171     1.01244
ln_elev~1500 |   .3405069   .3844199     0.89   0.379    -.4249709    1.105985
ln_elev~1600 |   .4369857    .377349     1.16   0.250    -.3144123    1.188384
ln_elev~1700 |   .3369144   .3336027     1.01   0.316    -.3273733    1.001202
ln_elev~1750 |   .4597131   .2961737     1.55   0.125    -.1300441     1.04947
ln_elev~1800 |   .2906457   .3118515     0.93   0.354      -.33033    .9116214
ln_elev~1850 |   .1828029   .3136124     0.58   0.562    -.4416792     .807285
ln_elev~1900 |   .2166321   .3055092     0.71   0.480    -.3917144    .8249787
 _Iyear_1100 |  (omitted)
 _Iyear_1200 |  -1.829213   1.185906    -1.54   0.127    -4.190654    .5322285
 _Iyear_1300 |  -1.729716    1.31821    -1.31   0.193    -4.354607    .8951755
 _Iyear_1400 |  (omitted)
 _Iyear_1500 |  -1.254083    1.85684    -0.68   0.501    -4.951524    2.443357
 _Iyear_1600 |  (omitted)
 _Iyear_1700 |  -1.294484   1.792071    -0.72   0.472    -4.862954    2.273986
 _Iyear_1750 |  -2.233828   1.447409    -1.54   0.127    -5.115988    .6483325
 _Iyear_1800 |  -1.532276   1.440242    -1.06   0.291    -4.400164    1.335612
 _Iyear_1850 |  -.6383761   1.466765    -0.44   0.665    -3.559079    2.282327
 _Iyear_1900 |  -.2306148   1.508016    -0.15   0.879    -3.233458    2.772229
 _Iyear_1100 |   -.496391   .7595047    -0.65   0.515    -2.008758    1.015976
 _Iyear_1200 |  (omitted)
 _Iyear_1300 |  (omitted)
 _Iyear_1400 |  -1.599408    1.30739    -1.22   0.225    -4.202754    1.003938
 _Iyear_1500 |  (omitted)
 _Iyear_1600 |  -1.658484   1.841383    -0.90   0.371    -5.325145    2.008178
 _Iyear_1700 |  (omitted)
 _Iyear_1750 |  (omitted)
 _Iyear_1800 |  (omitted)
 _Iyear_1850 |  (omitted)
 _Iyear_1900 |  (omitted)
_Icontinen~2 |   1.437927   .7263673     1.98   0.051    -.0084546    2.884309
_Icontinen~3 |  -2.296681   .5859023    -3.92   0.000    -3.463362   -1.130001
_Icontinen~4 |   .0089626   .9870326     0.01   0.993     -1.95647    1.974396
_IyeaX~100_2 |  -1.487943   .7639283    -1.95   0.055    -3.009119    .0332323
_IyeaX~100_3 |  (omitted)
_IyeaX~100_4 |  -1.987635   1.052493    -1.89   0.063    -4.083416    .1081452
_IyeaX~200_2 |  -1.465876   .8529889    -1.72   0.090    -3.164394    .2326422
_IyeaX~200_3 |  (omitted)
_IyeaX~200_4 |  -2.300089   1.242882    -1.85   0.068    -4.774983    .1748049
_IyeaX~300_2 |  -1.381658   .7399674    -1.87   0.066    -2.855122     .091805
_IyeaX~300_3 |  (omitted)
_IyeaX~300_4 |  -2.175992   1.096932    -1.98   0.051    -4.360264    .0082795
_IyeaX~400_2 |  -.8342721   .7441053    -1.12   0.266    -2.315975     .647431
_IyeaX~400_3 |  (omitted)
_IyeaX~400_4 |  -1.637059   1.145208    -1.43   0.157    -3.917461    .6433421
_IyeaX~500_2 |  -1.145867   .7628071    -1.50   0.137     -2.66481    .3730764
_IyeaX~500_3 |  (omitted)
_IyeaX~500_4 |  -1.963941   1.237717    -1.59   0.117    -4.428551    .5006687
_IyeaX~600_2 |  -1.019387   .6980861    -1.46   0.148    -2.409454    .3706803
_IyeaX~600_3 |  (omitted)
_IyeaX~600_4 |  -1.636013   1.227392    -1.33   0.186    -4.080062    .8080366
_IyeaX~700_2 |  -.9950551   .6578398    -1.51   0.134    -2.304982    .3148714
_IyeaX~700_3 |  (omitted)
_IyeaX~700_4 |  -1.597816   1.206395    -1.32   0.189    -4.000054    .8044227
_IyeaX~750_2 |  -.7879572   .7508711    -1.05   0.297    -2.283132    .7072181
_IyeaX~750_3 |  (omitted)
_IyeaX~750_4 |  -1.576041   1.231668    -1.28   0.205    -4.028605    .8765225
_IyeaX~800_2 |  -.5983431   .7525934    -0.80   0.429    -2.096948    .9002618
_IyeaX~800_3 |  (omitted)
_IyeaX~800_4 |  -1.407368    1.14158    -1.23   0.221    -3.680543    .8658075
_IyeaX~850_2 |  -.6913106   .7700922    -0.90   0.372     -2.22476    .8421388
_IyeaX~850_3 |  (omitted)
_IyeaX~850_4 |  -1.254626   1.181532    -1.06   0.292    -3.607358    1.098105
_IyeaX~900_2 |  -.7786738   .8158676    -0.95   0.343    -2.403274    .8459263
_IyeaX~900_3 |  (omitted)
_IyeaX~900_4 |  -.9267438   1.237941    -0.75   0.456      -3.3918    1.538312
       _cons |    10.1079    .492842    20.51   0.000     9.126531    11.08928
-------------+----------------------------------------------------------------
        city |   absorbed                                     (694 categories)

. 
. ******************************************************
. *** Baseline controls regressions - Omiting Europe ***
. ******************************************************
. 
. for @ in any ln_rugged ln_elevation ln_tropics ln_oworld: drop if missing(@)==1

->  drop if missing(ln_rugged)==1
(0 observations deleted)

->  drop if missing(ln_elevation)==1
(0 observations deleted)

->  drop if missing(ln_tropics)==1
(0 observations deleted)

->  drop if missing(ln_oworld)==1
(0 observations deleted)

. 
. save "working.dta", replace
(note: file working.dta not found)
file working.dta saved

. 
. use "working.dta", clear

. drop if continent=="Europe"
(674 observations deleted)

. 
. /* Column 3 - Baseline controls */
. *Conley SEs; num parms = 1 const + 348-1 city FE + 11 year FE + 1 wpot_post + 11*4 contr
> ols = 404 
. *preserve
. *xi: reg ln_city_population `ln_oworld_flexible' `ln_tropical_flexible' `ln_rugged_flexi
> ble' `ln_elevation_flexible' i.city i.year
. *predict ln_city_population_resid, resid
. *xi: reg ln_wpot_post       `ln_oworld_flexible' `ln_tropical_flexible' `ln_rugged_flexi
> ble' `ln_elevation_flexible' i.city i.year
. *predict ln_wpot_post_resid, resid
. *x_ols latitude longitude cutoff1 cutoff2 ln_city_population_resid ln_wpot_post_resid, x
> reg(2) coord(2)
. *restore
. * Clustered SEs
. xi: areg ln_city_population ln_wpot_post `ln_oworld_flexible' `ln_tropical_flexible' `ln
> _rugged_flexible' `ln_elevation_flexible' i.year, absorb(city) cluster(isocode)
i.year            _Iyear_1000-1900    (naturally coded; _Iyear_1000 omitted)

Linear regression, absorbing indicators                Number of obs =     933
                                                       F( 27, 45)    =       .
                                                       Prob > F      =
                                                       R-squared     =  0.7459
                                                       Adj R-squared =  0.5523
                                                       Root MSE      =  .46775

                               (Std. Err. adjusted for 46 clusters in isocode)
------------------------------------------------------------------------------
             |               Robust
ln_city_po~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_wpot_post |   .0354157   .0223459     1.58   0.120    -.0095912    .0804227
ln_owor~1100 |   .0249813   .0314372     0.79   0.431    -.0383364     .088299
ln_owor~1200 |   .0327737   .0362596     0.90   0.371    -.0402569    .1058043
ln_owor~1300 |  -.0012847   .0606052    -0.02   0.983    -.1233498    .1207804
ln_owor~1400 |   .0224926   .0464165     0.48   0.630     -.070995    .1159802
ln_owor~1500 |  -.0048461   .0604463    -0.08   0.936    -.1265911     .116899
ln_owor~1600 |  -.0070985   .0439342    -0.16   0.872    -.0955865    .0813896
ln_owor~1700 |   .0023258   .0379222     0.06   0.951    -.0740534     .078705
ln_owor~1750 |   .0084656   .0524735     0.16   0.873    -.0972214    .1141526
ln_owor~1800 |  -.0031723   .0491613    -0.06   0.949    -.1021882    .0958436
ln_owor~1850 |   .0116812   .0453527     0.26   0.798    -.0796637    .1030262
ln_owor~1900 |   .0198982   .0503296     0.40   0.694    -.0814707    .1212672
ln_trop~1100 |  -.0110776   .0339948    -0.33   0.746    -.0795466    .0573914
ln_trop~1200 |  -.0157127   .0342091    -0.46   0.648    -.0846132    .0531879
ln_trop~1300 |  -.0486912   .0301433    -1.62   0.113    -.1094028    .0120205
ln_trop~1400 |  -.0406078   .0320256    -1.27   0.211    -.1051106    .0238951
ln_trop~1500 |  -.0538682    .037825    -1.42   0.161    -.1300515    .0223152
ln_trop~1600 |  -.0433574   .0311557    -1.39   0.171    -.1061083    .0193934
ln_trop~1700 |  -.0332408   .0320911    -1.04   0.306    -.0978756     .031394
ln_trop~1750 |  -.0259236   .0337617    -0.77   0.447    -.0939232     .042076
ln_trop~1800 |  -.0224616   .0277238    -0.81   0.422    -.0783002    .0333771
ln_trop~1850 |  -.0177551   .0274916    -0.65   0.522    -.0731262    .0376159
ln_trop~1900 |  -.0405186   .0306502    -1.32   0.193    -.1022512     .021214
ln_rugg~1100 |   .2028707   .3741622     0.54   0.590    -.5507306    .9564721
ln_rugg~1200 |   .4465096   .4912441     0.91   0.368    -.5429069    1.435926
ln_rugg~1300 |   .3485614   .4970305     0.70   0.487    -.6525095    1.349632
ln_rugg~1400 |   .3265856   .4201266     0.78   0.441    -.5195927    1.172764
ln_rugg~1500 |    .477669   .4269792     1.12   0.269    -.3823112    1.337649
ln_rugg~1600 |   .4095835   .3625412     1.13   0.265    -.3206119    1.139779
ln_rugg~1700 |    .510606   .3757935     1.36   0.181     -.246281    1.267493
ln_rugg~1750 |   .3442716   .3583519     0.96   0.342    -.3774862    1.066029
ln_rugg~1800 |   .4174391   .3895439     1.07   0.290    -.3671426    1.202021
ln_rugg~1850 |   .6859554   .3809808     1.80   0.078    -.0813793     1.45329
ln_rugg~1900 |   .5958142   .4197229     1.42   0.163    -.2495511     1.44118
ln_elev~1100 |   .0437453   .1666067     0.26   0.794    -.2918179    .3793084
ln_elev~1200 |   .0440556   .2939965     0.15   0.882    -.5480839     .636195
ln_elev~1300 |   .2222553    .424254     0.52   0.603    -.6322361    1.076747
ln_elev~1400 |   .1789725   .2998145     0.60   0.554    -.4248849      .78283
ln_elev~1500 |   .0655233   .4345049     0.15   0.881    -.8096144     .940661
ln_elev~1600 |   .1012629   .4559795     0.22   0.825     -.817127    1.019653
ln_elev~1700 |   .2091895   .4369135     0.48   0.634    -.6707995    1.089179
ln_elev~1750 |   .2873991    .371918     0.77   0.444    -.4616822     1.03648
ln_elev~1800 |   .1219494    .411884     0.30   0.769    -.7076276    .9515264
ln_elev~1850 |  -.1414173   .4078967    -0.35   0.730    -.9629634    .6801288
ln_elev~1900 |   -.124643   .3620915    -0.34   0.732    -.8539326    .6046466
 _Iyear_1100 |  -.8575654   .6699505    -1.28   0.207    -2.206915    .4917842
 _Iyear_1200 |  -1.528345   .9838198    -1.55   0.127     -3.50986    .4531694
 _Iyear_1300 |   -1.82881   1.588897    -1.15   0.256    -5.029013    1.371393
 _Iyear_1400 |  -1.683571   1.119726    -1.50   0.140    -3.938815    .5716739
 _Iyear_1500 |  -.9864313    1.91508    -0.52   0.609    -4.843601    2.870739
 _Iyear_1600 |  -1.001209   1.980215    -0.51   0.616    -4.989566    2.987148
 _Iyear_1700 |   -2.12022   1.839892    -1.15   0.255    -5.825952    1.585513
 _Iyear_1750 |  -2.447435   1.533339    -1.60   0.117    -5.535738    .6408682
 _Iyear_1800 |  -1.424297   1.700546    -0.84   0.407    -4.849372    2.000778
 _Iyear_1850 |  -.2966111   1.720462    -0.17   0.864      -3.7618    3.168578
 _Iyear_1900 |   .1378452    1.55845     0.09   0.930    -3.001035    3.276725
       _cons |   10.94646   .2053717    53.30   0.000     10.53282     11.3601
-------------+----------------------------------------------------------------
        city |   absorbed                                     (348 categories)

. 
. /* Column 4 - Basline controls & continent x year FEs */
. * Conley SEs; num parms = 1 const + 348-1 city FE + 11 year FE + 1 wpot_post + 11*4 cont
> rols + 11*2 continent-year FE = 426 --- Had to do 2-step method
. *preserve
. *xi: reg ln_city_population `ln_oworld_flexible' `ln_tropical_flexible' `ln_rugged_flexi
> ble' `ln_elevation_flexible' i.city i.year `cont_asia_flexible' `cont_africa_flexible'
. *predict ln_city_population_resid, resid
. *xi: reg ln_wpot_post       `ln_oworld_flexible' `ln_tropical_flexible' `ln_rugged_flexi
> ble' `ln_elevation_flexible' i.city i.year `cont_asia_flexible' `cont_africa_flexible'
. *predict ln_wpot_post_resid, resid
. *x_ols latitude longitude cutoff1 cutoff2 ln_city_population_resid ln_wpot_post_resid, x
> reg(2) coord(2)
. *restore
. * Clustered SEs
. xi: areg ln_city_population ln_wpot_post `ln_oworld_flexible' `ln_tropical_flexible' `ln
> _rugged_flexible' `ln_elevation_flexible' `cont_asia_flexible' `cont_africa_flexible', a
> bsorb(city) cluster(isocode)

Linear regression, absorbing indicators                Number of obs =     933
                                                       F( 27, 45)    =       .
                                                       Prob > F      =
                                                       R-squared     =  0.7554
                                                       Adj R-squared =  0.5600
                                                       Root MSE      =  .45891

                               (Std. Err. adjusted for 46 clusters in isocode)
------------------------------------------------------------------------------
             |               Robust
ln_city_po~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_wpot_post |   .0392119   .0191895     2.04   0.047     .0005622    .0778616
ln_owor~1100 |   .0320832   .0396329     0.81   0.422    -.0477416    .1119079
ln_owor~1200 |   .0487631   .0398749     1.22   0.228    -.0315491    .1290752
ln_owor~1300 |   .0103301   .0552329     0.19   0.852    -.1009148    .1215749
ln_owor~1400 |   .0201426   .0532182     0.38   0.707    -.0870444    .1273297
ln_owor~1500 |    .001114   .0571721     0.02   0.985    -.1140365    .1162646
ln_owor~1600 |  -.0028499   .0481133    -0.06   0.953     -.099755    .0940553
ln_owor~1700 |   .0065514   .0421331     0.16   0.877    -.0783091    .0914118
ln_owor~1750 |   .0118361   .0562585     0.21   0.834    -.1014743    .1251465
ln_owor~1800 |   .0004116   .0539015     0.01   0.994    -.1081515    .1089748
ln_owor~1850 |   .0071565   .0503709     0.14   0.888    -.0942958    .1086087
ln_owor~1900 |   .0214481   .0548183     0.39   0.697    -.0889616    .1318578
ln_trop~1100 |  -.0202298   .0319698    -0.63   0.530    -.0846204    .0441607
ln_trop~1200 |  -.0239296   .0375019    -0.64   0.527    -.0994623    .0516031
ln_trop~1300 |  -.0561056   .0289189    -1.94   0.059    -.1143513    .0021402
ln_trop~1400 |  -.0389599   .0357444    -1.09   0.282    -.1109527    .0330329
ln_trop~1500 |  -.0609234   .0386598    -1.58   0.122    -.1387883    .0169416
ln_trop~1600 |  -.0450953   .0325837    -1.38   0.173    -.1107223    .0205317
ln_trop~1700 |  -.0333363   .0357067    -0.93   0.355    -.1052533    .0385806
ln_trop~1750 |  -.0224377   .0361189    -0.62   0.538     -.095185    .0503096
ln_trop~1800 |  -.0169489   .0300129    -0.56   0.575     -.077398    .0435002
ln_trop~1850 |  -.0128073   .0292992    -0.44   0.664    -.0718189    .0462043
ln_trop~1900 |  -.0354025   .0319433    -1.11   0.274    -.0997397    .0289347
ln_rugg~1100 |   .0284363   .3379634     0.08   0.933    -.6522568    .7091295
ln_rugg~1200 |   .2350294   .4531614     0.52   0.607    -.6776845    1.147743
ln_rugg~1300 |   .1729362   .4733139     0.37   0.717    -.7803669    1.126239
ln_rugg~1400 |   .3101496   .4134137     0.75   0.457    -.5225084    1.142808
ln_rugg~1500 |   .4552263   .3931447     1.16   0.253    -.3366078     1.24706
ln_rugg~1600 |   .3733006   .3860139     0.97   0.339    -.4041714    1.150773
ln_rugg~1700 |   .4776721   .3841649     1.24   0.220    -.2960757     1.25142
ln_rugg~1750 |   .2995864   .3699954     0.81   0.422    -.4456226    1.044795
ln_rugg~1800 |   .3933882   .4011405     0.98   0.332    -.4145502    1.201327
ln_rugg~1850 |    .629872   .3887708     1.62   0.112    -.1531525    1.412897
ln_rugg~1900 |   .5730645   .4252714     1.35   0.185     -.283476    1.429605
ln_elev~1100 |   .1785286   .1665394     1.07   0.289    -.1568989    .5139562
ln_elev~1200 |    .220193    .295084     0.75   0.459    -.3741366    .8145227
ln_elev~1300 |   .3749577   .3473775     1.08   0.286    -.3246964    1.074612
ln_elev~1400 |    .211875    .268702     0.79   0.435    -.3293186    .7530686
ln_elev~1500 |   .1103839   .4040031     0.27   0.786    -.7033202     .924088
ln_elev~1600 |   .1511488   .4773331     0.32   0.753    -.8102494    1.112547
ln_elev~1700 |   .2526414   .4405755     0.57   0.569    -.6347232    1.140006
ln_elev~1750 |   .3316716   .3753918     0.88   0.382    -.4244062    1.087749
ln_elev~1800 |   .1550795   .4142507     0.37   0.710    -.6792643    .9894233
ln_elev~1850 |  -.1000206   .4085861    -0.24   0.808    -.9229552     .722914
ln_elev~1900 |  -.0969297   .3613706    -0.27   0.790    -.8247675    .6309081
cont_as~1100 |  -1.354987   .8895878    -1.52   0.135    -3.146709    .4367344
cont_as~1200 |  -2.290334    1.31133    -1.75   0.088    -4.931487    .3508201
cont_as~1300 |  -2.483945   1.237125    -2.01   0.051    -4.975642    .0077526
cont_as~1400 |  -1.822561   1.077522    -1.69   0.098    -3.992801    .3476786
cont_as~1500 |  -1.250456     1.8179    -0.69   0.495    -4.911893    2.410982
cont_as~1600 |   -1.25272   2.119851    -0.59   0.558    -5.522318    3.016878
cont_as~1700 |  -2.336605    1.83977    -1.27   0.211    -6.042093    1.368882
cont_as~1750 |  -2.659192   1.546392    -1.72   0.092    -5.773786    .4554009
cont_as~1800 |  -1.616336   1.693588    -0.95   0.345    -5.027398    1.794725
cont_as~1850 |  -.4029049   1.763725    -0.23   0.820     -3.95523    3.149421
cont_as~1900 |  -.0082773   1.555273    -0.01   0.996    -3.140758    3.124204
cont_af~1100 |  -.6349423   .5467115    -1.16   0.252    -1.736076    .4661911
cont_af~1200 |  -1.514432   1.102179    -1.37   0.176    -3.734334    .7054694
cont_af~1300 |  -1.820063   1.591687    -1.14   0.259    -5.025885     1.38576
cont_af~1400 |  -1.804794    1.23506    -1.46   0.151    -4.292333    .6827444
cont_af~1500 |  -.8770635   2.047959    -0.43   0.671    -5.001865    3.247738
cont_af~1600 |  -1.061444   2.071603    -0.51   0.611    -5.233868    3.110979
cont_af~1700 |  -2.219377   1.874069    -1.18   0.243    -5.993947    1.555192
cont_af~1750 |  -2.710072   1.711726    -1.58   0.120    -6.157666    .7375218
cont_af~1800 |  -1.802367   1.905632    -0.95   0.349    -5.640507    2.035772
cont_af~1850 |  -.5724594   1.995058    -0.29   0.775    -4.590713    3.445794
cont_af~1900 |  -.1225786   1.927263    -0.06   0.950    -4.004285    3.759128
       _cons |   10.92064   .2172573    50.27   0.000     10.48306    11.35822
-------------+----------------------------------------------------------------
        city |   absorbed                                     (348 categories)

. 
. ***************************
. *** Keeping only Europe ***
. ***************************
. 
. use "working.dta", clear

. keep if continent=="Europe"
(933 observations deleted)

. 
. tab continent

  Continent the |
   cities is on |      Freq.     Percent        Cum.
----------------+-----------------------------------
         Europe |        674      100.00      100.00
----------------+-----------------------------------
          Total |        674      100.00

. 
. /* Column 5 - Baseline controls */
. * Conley SEs; num parms = 1 const + 350-1 city FE + 11 year FE + 1 wpot_post + 11*44 con
> trols = 406
. *xi: x_ols latitude longitude cutoff1 cutoff2 ln_city_population constant ln_wpot_post `
> ln_oworld_flexible' `ln_tropical_flexible' `ln_rugged_flexible' `ln_elevation_flexible' 
> i.year i.city, xreg(404) coord(2)
. * Clustered SEs
. xi: areg ln_city_population ln_wpot_post `ln_oworld_flexible' `ln_tropical_flexible' `ln
> _rugged_flexible' `ln_elevation_flexible' i.year, absorb(city) cluster(isocode)
i.year            _Iyear_1000-1900    (naturally coded; _Iyear_1000 omitted)

Linear regression, absorbing indicators                Number of obs =     674
                                                       F( 24, 31)    =       .
                                                       Prob > F      =
                                                       R-squared     =  0.8741
                                                       Adj R-squared =  0.6874
                                                       Root MSE      =  .42225

                               (Std. Err. adjusted for 32 clusters in isocode)
------------------------------------------------------------------------------
             |               Robust
ln_city_po~n |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ln_wpot_post |   .0337378   .0749798     0.45   0.656    -.1191846    .1866602
ln_owor~1100 |   2.578713   .1255605    20.54   0.000      2.32263    2.834795
ln_owor~1200 |   3.067936   .1898113    16.16   0.000     2.680814    3.455059
ln_owor~1300 |   2.747789   .3077231     8.93   0.000     2.120184    3.375395
ln_owor~1400 |   2.769612   .3083803     8.98   0.000     2.140666    3.398558
ln_owor~1500 |   2.911526   .3862073     7.54   0.000     2.123851    3.699201
ln_owor~1600 |   3.109645   .1447285    21.49   0.000     2.814469    3.404821
ln_owor~1700 |   3.168078   .3059342    10.36   0.000     2.544121    3.792035
ln_owor~1750 |   3.042073   .2607877    11.66   0.000     2.510193    3.573953
ln_owor~1800 |   2.955054   .2610236    11.32   0.000     2.422693    3.487415
ln_owor~1850 |   3.108788   .2762757    11.25   0.000      2.54532    3.672256
ln_owor~1900 |   3.175951   .2442541    13.00   0.000     2.677792    3.674111
ln_trop~1100 |     .29258   .0381518     7.67   0.000     .2147688    .3703912
ln_trop~1200 |   .3024431   .0446535     6.77   0.000     .2113717    .3935145
ln_trop~1300 |   .2750161   .0210558    13.06   0.000     .2320725    .3179597
ln_trop~1400 |   .2336866   .0436895     5.35   0.000     .1445813    .3227919
ln_trop~1500 |   .2711529   .0666826     4.07   0.000     .1351529     .407153
ln_trop~1600 |   .2221716   .0186279    11.93   0.000     .1841797    .2601635
ln_trop~1700 |   .2617321   .0382795     6.84   0.000     .1836606    .3398036
ln_trop~1750 |    .273616    .037873     7.22   0.000     .1963734    .3508585
ln_trop~1800 |   .2888123   .0434206     6.65   0.000     .2002555    .3773692
ln_trop~1850 |   .2573225   .0381062     6.75   0.000     .1796044    .3350406
ln_trop~1900 |   .2183961   .0264359     8.26   0.000     .1644797    .2723124
ln_rugg~1100 |  (omitted)
ln_rugg~1200 |   1.270394   .5813434     2.19   0.037     .0847362    2.456052
ln_rugg~1300 |   .6375724   1.763409     0.36   0.720    -2.958924    4.234069
ln_rugg~1400 |   .6651259   1.869697     0.36   0.724    -3.148146    4.478397
ln_rugg~1500 |   .1803324   1.376172     0.13   0.897    -2.626388    2.987053
ln_rugg~1600 |   .2376586   .3174526     0.75   0.460    -.4097902    .8851073
ln_rugg~1700 |   -.456148   .3989909    -1.14   0.262    -1.269895    .3575992
ln_rugg~1750 |  -.2744152   .4279662    -0.64   0.526    -1.147258    .5984277
ln_rugg~1800 |  -.1486697   .3997504    -0.37   0.712    -.9639661    .6666267
ln_rugg~1850 |  -.3303602   .7363213    -0.45   0.657    -1.832097    1.171377
ln_rugg~1900 |  -.4598186   .7243563    -0.63   0.530    -1.937153    1.017516
ln_elev~1100 |  -.7380069   .1168675    -6.31   0.000    -.9763596   -.4996541
ln_elev~1200 |  -.3192411   .2520606    -1.27   0.215     -.833322    .1948398
ln_elev~1300 |  -.3878489   .7653837    -0.51   0.616    -1.948859    1.173161
ln_elev~1400 |   -.345833   .8206535    -0.42   0.676    -2.019567    1.327901
ln_elev~1500 |   .0420652   .5709711     0.07   0.942    -1.122438    1.206568
ln_elev~1600 |   .1889568   .1345341     1.40   0.170    -.0854272    .4633409
ln_elev~1700 |   .2641305   .2954457     0.89   0.378    -.3384349    .8666959
ln_elev~1750 |   .2242338   .3178198     0.71   0.486     -.423964    .8724317
ln_elev~1800 |   .0914821    .298929     0.31   0.762    -.5181876    .7011519
ln_elev~1850 |   .2291719   .6220583     0.37   0.715    -1.039524    1.497868
ln_elev~1900 |   .3340881   .6294922     0.53   0.599    -.9497697    1.617946
 _Iyear_1100 |  -22.47514   .7460104   -30.13   0.000    -23.99664   -20.95364
 _Iyear_1200 |  -33.94441    3.24647   -10.46   0.000    -40.56563   -27.32319
 _Iyear_1300 |  -28.34695   5.026809    -5.64   0.000     -38.5992   -18.09471
 _Iyear_1400 |  -28.58583   5.250319    -5.44   0.000    -39.29393   -17.87774
 _Iyear_1500 |  -31.36815   7.221557    -4.34   0.000    -46.09661   -16.63969
 _Iyear_1600 |  -33.80424   2.085605   -16.21   0.000    -38.05786   -29.55062
 _Iyear_1700 |  -33.31363   3.841092    -8.67   0.000    -41.14758   -25.47967
 _Iyear_1750 |  -32.60207   1.857995   -17.55   0.000    -36.39147   -28.81266
 _Iyear_1800 |  -31.23675   2.369287   -13.18   0.000    -36.06894   -26.40455
 _Iyear_1850 |  -32.41531   3.749559    -8.65   0.000    -40.06259   -24.76804
 _Iyear_1900 |  -32.46521   3.406375    -9.53   0.000    -39.41256   -25.51786
       _cons |   11.15732   .1030451   108.28   0.000     10.94715    11.36748
-------------+----------------------------------------------------------------
        city |   absorbed                                     (348 categories)

. 
. erase "working.dta"

. 
. log close
      name:  <unnamed>
       log:  /Users/nathannunn/Documents/Dropbox/Potatoes/REPLICATION_FILES/Replication_ci
> ty_level_results.log
  log type:  text
 closed on:  19 Sep 2010, 18:33:42
------------------------------------------------------------------------------------------
